import 'package:flutter/material.dart';
class firstPage extends StatefulWidget {
  @override
  _firstPageState createState() => _firstPageState();
}

class _firstPageState extends State<firstPage> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
          backgroundColor: Colors.pink[100],
          title: Text("IsGirls"),
        ),
        backgroundColor: Colors.white,
        body: SingleChildScrollView
        (
          child: Stack(
            children: [
              Container(
                  child: Column(children: <Widget>[
                    Image.asset(
                      'images/mg.png',
                      height: 520,
               
                    ),
                     
                  ]),
                ),

                 Padding(
                      padding: const EdgeInsets.only(top:235,left:30,right:30),
                      child: Column(
                        children: [
                          Text("ขั้นตอนที่ 1 : ล้างเครื่องสำอางออกก่อนเสมอ ผู้หญิงเรามักนิยมแต่งหน้าออกจากบ้านทุกครั้ง หลังกลับมาถึงบ้านแล้วควรล้างเครื่องสำอางออกให้หมดจดเสมอด้วยเมคอัพรีมูฟเวอร์ เพราะมันเป็นผลิตภัณฑ์สำหรับล้างคราบเครื่องสำอางออกได้อย่างหมดจดเกลี้ยงเกลาแท้จริง จากนั้นจึงทำการล้างหน้าต่อไปตามปกติ"),
                          Text(""),
                          Text("ขั้นตอนที่ 2 : ใช้ผลิตภัณฑ์ล้างหน้าที่เหมาะกับสภาพผิว ควรเลือกใช้ผลิตภัณฑ์ล้างหน้าที่เหมาะสมกับสภาพผิวของเราไว้ก่อน สาวคนไหนที่มีผิวแพ้ง่ายหรือผิวแห้งยิ่งต้องใส่ใจกับผลิตภัณฑ์ที่มีค่าความอ่อนโยนต่อผิวให้มากเข้าไว้"),
                          Text(""),
                          Text("ขั้นตอนที่ 3 : วิธีล้างหน้าอย่างถูกต้องวิธีการล้างหน้าอย่างถูกต้อง ควรเลือกล้างด้วยอุณหภูมิน้ำปกติหรือหากสาวคนไหนแต่งหน้าจัดอาจเลือกล้างหน้าด้วยน้ำอุ่นก่อนเปิดขยายรูขุมขน สิ่งสกปรกจะได้หลุดออกมาจากนั้นบีบครีมโฟมลงบนฝ่ามือถูวนให้ทั่วจนเกิดฟอง แล้วจึงนำมาถูบนผิวหน้าเราให้ทั่วถึง เมื่อมั่นใจว่าถูจนทั่วและสะอาดดีแล้วจึงล้างหน้าออกด้วยน้ำอุ่นหรือน้ำธรรมดา จากนั้นล้างปิดท้ายด้วยน้ำเย็นเพื่อปิดกระชับรูขุมขนอีกครั้ง"),
                          Text(""),
                          Text("ขั้นตอนที่ 4 : ทาครีมบำรุงผิวทันที หลังจากล้างหน้าเสร็จแล้วควรซับหน้าเบาๆ ด้วยผ้าขนหนูผืนนิ่ม และหากสาวๆ คนไหนที่คิดว่าคราบสิ่งสกปรกยังหลุดออกไม่หมดก็สามารถเช็ดด้วยโทนเนอร์ซ้ำอีกครั้งได้ แต่ควรเลือกประเภทที่ไร้แอลกอฮอล์ ไม่เช่นนั้นจะทำให้ผิวหน้าแห้งตึงขึ้นได้ แนะนำให้ใช้ประเภทที่มีส่วนผสมจากมอยส์เจอไรเซอร์ค่ะ เพื่อบำรุงผิวหน้าให้ชุ่มชื้นไปพร้อมกัน และที่สำคัญอย่าลืมทาครีมบำรุงผิวที่มีคุณสมบัติเหมาะสมกับผิวคุณทันที เพียงเท่านี้การมีหน้าใสไร้สิวก็จะอยู่ไม่ไกลเกินเอื้อมแล้วค่ะ"),
                          Text(""),
                        ],
                      ),
                      
                    )
            ],
          ),
        ),
        );
  }
}