import 'package:flutter/material.dart';
class secondPage extends StatefulWidget {
  @override
  _secondPageState createState() => _secondPageState();
}

class _secondPageState extends State<secondPage> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
          title: Text("IsGirls"),
          backgroundColor: Colors.pink[100],
        ),
        backgroundColor: Colors.white,
         body: SingleChildScrollView
        (
       child: Stack(
          children: [
            Container(
                child: Column(children: <Widget>[
                  Image.asset(
                    'images/mi.png',
                    height: 520,
             
                  ),
                   
                ]),
              ),

              Padding(
                      padding: const EdgeInsets.only(top:235,left:30,right:30),
                      child: Column(
                        children: [
                          Text("ขั้นตอนที่ 1 : Makeup Remover เราต้องมาเริ่มกันที่การคลีนผิวหน้าก่อนเลยค่ะ ในตอนกลางคืนเราก็อาจจะต้องใช้ Makeup Remover ในการเช็ดเครื่องสำอาง ฝุ่น หรือสิ่งสกปรกบนใบหน้ากันก่อน เพราะทั้งวันเราเจอมลภาวะ สิ่งสกปรกเยอะมาก ควรจะเช็ดออกให้หมดค่ะ! แต่ในตอนเช้าอาจจะไม่ต้องใช้ตัวนี้นะคะ ส่วนในเรื่องการเลือก Makeup Remover เราก็แนะนำว่าให้เลือกตัวที่เหมาะกับสภาพผิวเราค่ะ และควรจะแยกใช้ตัวที่เช็ดเฉพาะส่วนอย่างรอบดวงตา และริมฝีปากด้วย เพราะเค้าเป็นส่วนที่บอบบางมาก อาจจะระคายเคืองได้ง่าย"),
                          Text(""),
                          Text("ขั้นตอนที่ 2 : Cleanser หลังจากเช็ดเครื่องสำอางและสิ่งสกปรกบนใบหน้าไปแล้ว ต่อไปเราก็ต้องมาล้างหน้ากันค่ะ และ Facial Cleanser ก็มีหลากหลายแบบมาก ทั้งเป็นโฟม เป็นเจล หรือแม้แต่สบู่ ดังนั้นเลือกให้เหมาะสมกับสภาพผิวหน้าของเรากันนะคะทุกคน"),
                          Text(""),
                          Text("ขั้นตอนที่ 3 : Toner หลังจากทำความสะอาดใบหน้าแล้ว เราก็จะลง Toner เพื่อเปิดรูขุมขน และปรับสภาพผิวให้พร้อมรับการบำรุงต่อ เพื่อให้สกินแคร์ที่เราใช้หลังจากนี้ซึมเข้าสู่ผิวได้ดีขึ้น แถมยังช่วยสร้างสมดุลให้กับผิวหน้าของเราด้วยค่ะ ถ้าใครยังสงสัยในเรื่องของโทนเนอร์ & คลีนซิ่งต่างกันอย่างไร สัญญาว่ากระทู้หน้าเราจะมาไขข้อข้องใจกันค่ะ"),
                          Text(""),
                          Text("ขั้นตอนที่ 4 : Spot Treatment ต่อไปจะเป็นการบำรุงผิวเฉพาะจุด หรือ Spot Treatment ค่ะ บำรุงผิวเฉพาะจุดก็จะเป็นจำพวกครีมทาสิว ครีมทารอยจุดด่างดำ รอยแผลต่างๆ ที่เราต้องการการบำรุงแบบเฉพาะจุดนั่นเองค่า สาเหตุที่เราต้องทาเฉพาะจุดก่อนลงสกินแคร์ตัวอื่น เพราะว่าควรให้เนื้อสกินแคร์สัมผัสกับผิวโดยตรงมากที่สุด เพื่อให้เกิดผลลัพธ์สูงสุดนั่นเองค่ะ"),
                          Text(""),
                          Text("ขั้นตอนที่ 5 : Eye Cream เราคิดว่าอายครีมอาจจะเป็นหนึ่งใน List ของการทาสกินแคร์เฉพาะจุดด้วยนะ แต่ก็ดั๊นนนน มีอายครีมที่สามารถทาได้ทั้งหน้าด้วย งงมะ 55555 เดี๋ยวนี้วงการสกินแคร์เค้าพัฒนาไปไกลมากจริงๆ การทาอายครีมก็สำคัญมากนะคะ อย่างที่เค้าบอกว่าดวงตาเป็นหน้าต่างของหัวใจ แปลว่ารอบๆดวงตาอาจจะเปรียบเสมือนฝาบ้าน (เราบัญญัติขึ้นมาเอง 55555) ถ้าฝาบ้านดูไม่ดี ก็ส่งผลให้หน้าต่างดูไม่ดีไปด้วยเนอะ ดังนั้นอย่าปล่อยให้รอบดวงตาของเราเหี่ยว คล้ำ บวม หรือโทรมเน้อ"),
                          Text(""),
                          Text("ขั้นตอนที่ 6 : Essence/Serum บางคนก็จะมีตัว Pre-essence ลงก่อน เพื่อปรับสภาพผิวอีกครั้งหลังจากเช็ดโทนเนอร์ ขั้นตอนนี้ก็ถือว่ามีความสำคัญมากเลยนะคะทุกคน เพราะหลายๆตัวเค้ามีคุณสมบัติช่วยให้ใบหน้าเราสามารถรับการบำรุงเพิ่มมากขึ้น แถมยังทำให้ผิวชุ่มชื่นอิ่มน้ำด้วยค่ะ"),
                          Text(""),
                          Text("ขั้นตอนที่ 7 : Day/Night Cream เนื่องจากว่าเนื้อครีมส่วนมากจะมีความเข้มข้น และหนาแน่นที่สุด เราเลยต้องใช้ในขั้นตอนท้ายๆของการลงสกินแคร์ และขั้นตอนนี้แหละที่ทำให้ผิวหน้าเราได้รับการบำรุงสูงสุด อย่าลืมเลือกครีมให้เหมาะกับปัญหา และสภาพผิวของเราน้า"),
                          Text(""),

                        ],
                      ),
                      
                    )
            ],
          ),
          ),
        );
  }
}